# PANDAS

In [1]:
import pandas as pd

## Q.1 Create a dataset

In [11]:
data = {
    "Tid" : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "Refund" : ["Yes", "No", "No", "Yes", "No", "No", "Yes", "No", "No", "No"],
    "Marital Status" : ["Single", "Married", "Single", "Married", "Divorced", "Married", "Divorced", "Single", "Married", "Single"],
    "Taxable Income" : ["125K", "100K", "70K", "120K", "95K", "60K", "220K", "85K", "75K", "90K"],
    "Cheat" : ["No", "No", "No", "No", "Yes", "No", "No", "Yes", "No", "Yes"]
}

In [17]:
df = pd.DataFrame(data)

In [21]:
df.head()

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes

## Q.2 Locate row 0, 4, 7 and 8 using DataFrame.

In [24]:
print(df.loc[[0,4,7,8]])

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
4    5     No       Divorced            95K   Yes
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No

## Q.3 Navigate the DataFrame and do the following task

### 1. Select row from index 3 to 7.

In [28]:
print(df.iloc[3:7])

   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No

### 2. Select row from index 4 to 8, and column 2 to 4.

In [31]:
print(df.iloc[4:8,2:4])

  Marital Status Taxable Income
4       Divorced            95K
5        Married            60K
6       Divorced           220K
7         Single            85K

### 3. Select all rows with column index 1 to 3

In [36]:
print(df.iloc[:,1:4])

  Refund Marital Status Taxable Income
0    Yes         Single           125K
1     No        Married           100K
2     No         Single            70K
3    Yes        Married           120K
4     No       Divorced            95K
5     No        Married            60K
6    Yes       Divorced           220K
7     No         Single            85K
8     No        Married            75K
9     No         Single            90K

## Q.4 Read a csv file and display its first five rows.

In [39]:
file_read = pd.read_csv('Iris.csv')
file_read.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

## Q.5 From the csv file delete row 4, and delete column 3. Display the result.

In [44]:
file_read = file_read.drop(index=4)
file_read = file_read.drop(columns=file_read.columns[3])

In [46]:
file_read.head()

   Id  SepalLengthCm  SepalWidthCm  PetalWidthCm      Species
0   1            5.1           3.5           0.2  Iris-setosa
1   2            4.9           3.0           0.2  Iris-setosa
2   3            4.7           3.2           0.2  Iris-setosa
3   4            4.6           3.1           0.2  Iris-setosa
5   6            5.4           3.9           0.4  Iris-setosa

## Q.6 Create a sample dataset containing information about employees in a company

In [50]:
Employee={
    "Employee_Id" : [101,102,103,104,105],
    "Name" : ['Alice','Bob','Charlie','Diana','Edward'],
    "Department" : ['HR','IT','IT','Marketing','Sales'],
    "Age" : [29,34,41,28,38],
    "Salary" : [50000,70000,65000,55000,60000],
    "Years_of_Experience" : [4,8,10,3,12],
    "Joining_Date" : ['2020-03-15','2017-07-19','2013-06-01','2021-02-10','2010-11-25'],
    "Gender" : ['Female','Male','Male','Female','Male'],
    "Bonus" : [5000,7000,6000,4500,5000],
    "Rating" : [4.5,4.0,3.8,4.7,3.5]
}

In [52]:
Employee_data = pd.DataFrame(Employee)
print(Employee_data)

   Employee_Id     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

### a) Shape of the DataFrame.

In [55]:
print("Shape of the DataFrame : ")
print(Employee_data.shape)

Shape of the DataFrame :
(5, 10)

### b) Summary of the DataFrame that includes the data types and non-null counts for each column.

In [58]:
print("Summary of the DataFrame : ")
Employee_data.info()

Summary of the DataFrame :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_Id          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes

### c) Generate descriptive statistics.

In [61]:
print("descriptive statistics : ")
print(Employee_data.describe())

descriptive statistics :
       Employee_Id        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

### d) Display the first 5 rows and last 3 rows of the dataset.

In [64]:
print("the first 5 rows and last 3 rows of the dataset :")
print(Employee_data.head())
print(Employee_data.tail(3))

the first 5 rows and last 3 rows of the dataset :
   Employee_Id     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
   Employee_Id     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

### e) Calculate the following statistics from the dataset:

#### i. The average salary of employees.

In [68]:
average_salary = Employee_data["Salary"].mean()
print(f"The average salary of employees : {average_salary}")

The average salary of employees : 60000.0

#### ii. The total bonus paid to all employees.

In [71]:
total_bonus = Employee_data["Bonus"].sum()
print(f"The total bonus paid to all employees : {total_bonus}")

The total bonus paid to all employees : 27500

#### iii. The youngest employee's age.

In [74]:
youngest_employee = Employee_data["Age"].min()
print(f"The youngest employee's age : {youngest_employee}")

The youngest employee's age : 28

#### iv. The highest performance rating.

In [79]:
highest_performance = Employee_data["Rating"].max()
print(f"The highest performance rating : {highest_performance}")

The highest performance rating : 4.7

### f) Sort the DataFrame by the Salary column in descending order.

In [82]:
sort_salary = Employee_data.sort_values(by="Salary",ascending=False)
print(f"Sorted dataframe by salary : {sort_salary}")

Sorted dataframe by salary :    Employee_Id     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

### g) Add a new column that categorizes employees based on their performance rating:

#### i. Excellent for ratings >= 4.5
#### ii. Good for ratings >= 4.0 but < 4.5
#### iii. Average for ratings < 4.0

In [85]:
def rating_categorized(rating):
    if(rating >= 4.5):
        return "Excellent"
    elif 4 <= rating < 4.5:
        return "Good"
    else:
        return "Average"
Employee_data["Performance"] = Employee_data["Rating"].apply(rating_categorized)
print(Employee_data)

   Employee_Id     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating Performance
0   2020-03-15  Female   5000     4.5   Excellent
1   2017-07-19    Male   7000     4.0        Good
2   2013-06-01    Male   6000     3.8     Average
3   2021-02-10  Female   4500     4.7   Excellent
4   2010-11-25    Male   5000     3.5     Average

### h) Identify missing values in the DataFrame

In [90]:
print(Employee_data.isnull())

   Employee_Id   Name  Department    Age  Salary  Years_of_Experience  \
0        False  False       False  False   False                False
1        False  False       False  False   False                False
2        False  False       False  False   False                False
3        False  False       False  False   False                False
4        False  False       False  False   False                False

   Joining_Date  Gender  Bonus  Rating  Performance
0         False   False  False   False        False
1         False   False  False   False        False
2         False   False  False   False        False
3         False   False  False   False        False
4         False   False  False   False        False

### i) Rename the Employee_ID column to ID.

In [93]:
Employee_data.rename(columns={"Employee_Id":"ID"},inplace=True)
print(Employee_data)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance
0  Female   5000     4.5   Excellent
1    Male   7000     4.0        Good
2    Male   6000     3.8     Average
3  Female   4500     4.7   Excellent
4    Male   5000     3.5     Average

### j) Find all employees who:

#### i. Have more than 5 years of experience.
#### ii. Belong to the IT department.

In [99]:
Experience = Employee_data[Employee_data["Years_of_Experience"]>5]
print(Experience)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average
4   Male   5000     3.5     Average

In [101]:
IT_department = Employee_data[Employee_data["Department"] == "IT"]
print(IT_department)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average

### k) Modify the dataset by adding a new column, Tax, which deducts 10% of the Salary.

In [106]:
def deduct_salary(Salary):
        return (Salary*(1/10))
Employee_data["Tax"] = Employee_data["Salary"].apply(deduct_salary)
print(Employee_data)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance     Tax
0  Female   5000     4.5   Excellent  5000.0
1    Male   7000     4.0        Good  7000.0
2    Male   6000     3.8     Average  6500.0
3  Female   4500     4.7   Excellent  5500.0
4    Male   5000     3.5     Average  6000.0

### l) Save the modified DataFrameto a new CSV file.

In [109]:
Employee_data.to_csv("new.csv")